'''
1, 2, 3을 더해서 n을 만드는 법은 n-1에 1을 더하기, n-2에 2를 더하기, n-3에 3을 더하기밖에 없다.
중복 없는건 알겠는데 어케알았ㅇㅁ? 무슨 분야? 수학이겠지?

1: 1
2: 11   2
3: 111  12  21  3
4: 1111 112 121 211 22  13  31

n 만들기: n-1에 1붙여, n-2에 2 붙여, n-3에 3 붙여 -> 하고나면 서로 중복 없애줌
5: 4에 1, 3에 2, 2에 3
    4: 1111 112 121 211 22  13  31  끝에 1붙여  11111   1121    1211    2111    221     131     311
    3: 111  12  21  3               끝에 2붙여  1112    123     213     32
    2: 11   2                       끝에 3붙여  113     23
'''

import sys
lst=[0] * 11
lst[1]=1
lst[2]=2
lst[3]=4

for i in range(4,11):
    lst[i]=lst[i-1]+lst[i-2]+lst[i-3]

n = int(sys.stdin.readline())
for _ in range(n):
    input= int(sys.stdin.readline())
    print(lst[input])